app/Controllers/Backend/Banners.php

    public function index()
    {

        $data = [
            'title' => 'Banner',
            'header' => 'Banner',
            'banners' => $this->ModelBanners->getData('banner'),
            'userData' => session()->get()
        ];
---
SELECT *
FROM `banner`