app/Controllers/Backend/Datas.php

SELECT `data`.*, `divisi`.`nm_divisi`, `status`.`nm_status`, `format_data`.`nm_format`, `disagregasi`.`nm_disagregasi`, `jenis_data`.`jenis_data`
FROM `data`
INNER JOIN `divisi` ON `divisi`.`id` = `data`.`id_divisi`
INNER JOIN `disagregasi` ON `disagregasi`.`id` = `data`.`id_disagregasi`
INNER JOIN `status` ON `status`.`id_status` = `data`.`id_status_daftar`
INNER JOIN `jenis_data` ON `jenis_data`.`id` = `data`.`id_jenis_data`
INNER JOIN `format_data` ON `format_data`.`id` = `data`.`id_format`
---
    public function builder($where = false)
    {
        if ($where == false) {
            return $this->ModelDatas->select('data.*,
            divisi.nm_divisi,
            status.nm_status,
            format_data.nm_format,
            disagregasi.nm_disagregasi,
            jenis_data.jenis_data')
                ->join('divisi', 'divisi.id = data.id_divisi', 'inner')
                ->join('disagregasi', 'disagregasi.id = data.id_disagregasi', 'inner')
                ->join('status', 'status.id_status = data.id_status_daftar', 'inner')
                ->join('jenis_data', 'jenis_data.id = data.id_jenis_data', 'inner')
                ->join('format_data', 'format_data.id = data.id_format', 'inner')
                ->findAll();