app/Controllers/Backend/Masterpusats.php

SELECT *
FROM `divisi`
---
    public function index()
    {
        $data = [
            'title' => 'Master Pusat',
            'header' => 'Master Pusat',
            'divisi' => $this->ModelPusats->getData('divisi'),
            'userData' => session()->get()


        ];