app/Controllers/Backend/Masterstatus.php

    public function index()
    {

        // $status = $this->ModelStatus->findAll();
        $data = [
            'title' => 'Master status',
            'header' => 'Master status',
            'status' => $this->ModelStatus->getData('status'),
            'userData' => session()->get()

        ];
---
SELECT *
FROM `status`

    public function edit($slug)
    {
        $datas = $this->ModelStatus->getData('status', $slug);
        $data = [
            'title' => 'Ubah status',
            'header' => 'Ubah status',
            'status' => $datas,
            'userData' => session()->get()
        ];
---
SELECT *
FROM `status`
WHERE `slug` = 'daftar-data-diusulkan'
 LIMIT 1